<template>
  <div class="container1">
    <div class="header2">
      <h5>Отзывы о сервисе</h5>
    </div>
    <div class="reviews">
      <div class="review-block" v-for="(review, index) in reviews" :key="index">
        <h2>
          <mdiAccountCircleOutline class="icon" /> {{ review.title }}
        </h2>
        <p>{{ review.text }}</p>
      </div>
    </div>
    <div class="button-container">
      <button class="submit-button">Оставить свой отзыв о FamilyTree</button>
    </div>
  </div>
</template>

<script>
import mdiAccountCircleOutline from 'vue-material-design-icons/AccountCircleOutline.vue';

export default {
  data() {
    return {
      reviews: [
        { title: 'Николай', text: 'Благодаря сайту FamilyTree я собрал воедино всю информацию о своих предках, которую собирал уже порядка 4-х лет, и смог взглянуть на всех своих предков в одном большом древе!' },
        { title: 'Анна', text: 'Интуитивно понятный интерфейс FamilyTree позволил не тратить время на изучение платформы, испособствовал быстрому «росту» моего семейного дерева. Возможность сохранять документы и фотографии делает мое дерево максимально одушевленным. Вся семья рада приносить новую информацию и раскапывать что-то новое' },
        { title: 'Мария', text: 'Сервис FamilyTree сразу привлек мое внимание современным стилем и простым интерфейсом. Заполнять генеалогическое древо оказалось простым и приятным процессом. Отдельное внимание привлекла функция автоматической перестройки древа от любой выбранной персоны — это полезно, когда дерево большое, родственников много каждый хочет увидеть «свою историю»' },
        { title: 'Алексей', text: 'Благодарю команду FamilyTree за удобный в использовании продукт! Благодаря сервису оцифровки древа FamilyTree мы смогли составить генеалогическое древо до 8–10 колена по разным ветвям, восстановить ветвь моей прапрабабушки, найти новых родственников, познакомиться и даже встретиться на родине предков!' },
        { title: 'Игорь', text: 'Благодаря FamilyTree я наконец-то начал составлять генеалогическое древо! Сервис очень удобный, легкий, техподдержка отвечает быстро и по делу! Так же очень нравится чат единомышленников, где более опытные пользователи могут подсказать где и на каких ресурсах можно поискать информацию о своих предках. Желаю сервису дальнейшего развития и с нетерпением жду мобильную версию!' },
        { title: 'Анастасия', text: 'Генеалогия как простое построение древа — занятие довольно скучное и рано или поздно надоедает. А вот заставить заговорить каждый листочек на этом древе — вот это истинное наслаждение! Сервис FamilyTree позволяет искать следы, которые оставляет каждый человек в истории. Собирать воедино страницы жизни разных людей, которых прямо или косвенно связал воедино большой Род. Узнавая о каждом человеке в большом разветвленном дереве, о каждой отдельной ветви, ты отправляешься в самое увлекательное путешествие: историческое, приключенческое, иногда трагическое, иногда комическое. Но никогда не скучное. FamilyTree предоставляет такую возможность каждому. А еще с его помощью можно взять в путешествие любого человека. Для меня это оказалось единственной возможностью внятно делиться своими находками с близкими и дальними родственниками. И каждый раз узнавать что-то новое. Продолжать свой путь от человека к человеку. И... дарить людям радость, находя их самых близких, информация о которых считалась давно утраченной' }
      ]
    };
  },
  components: {
    mdiAccountCircleOutline
  }
};
</script>

<style>
.container1 {
  max-width: 800px;
  margin: 0 auto;
  padding: 20px;
}

.header2 {
  text-align: center;
}

h5 {
  font-size: 60px;
  margin-bottom: 50px;
  color: rgb(47, 47, 47);
}

.reviews {
  display: grid;
  grid-template-columns: repeat(2, 1fr);
  gap: 30px;
  margin: 5px -244px;
  font-size: 23px;
}

.review-block {
  background-color: #e0e0e0;
  padding: 30px;
  border-radius: 37px;
  height: auto;
  width: 551px;
}

.review-block h2 {
  margin: 0;
  display: flex;
  align-items: center;
}

.icon {
  margin-right: 10px;
}

.review-block p {
  margin: 10px 0 0;
}

.button-container {
  text-align: center;
  margin-top: 50px;
}

.submit-button {
  font-size: 20px;
  background-color: rgb(97, 119, 237);
  color: white;
  padding: 19px 40px;
  border: none;
  border-radius: 15px;
  cursor: pointer;
}

.submit-button:hover {
  background-color: rgb(81, 105, 240);
}
</style>